#+TITLE: Register Machines and Hardware Architecture
#+AUTHOR: Fabricio Puente-Mansilla
#+DATE:  <2026-05-24 Sun>
#+OPTIONS: toc:2
#+PROPERTY: header-args:elisp :results output :exports both

* Elisp Demonstration: Simulating the GCD Register Machine

We can simulate this register machine in Elisp using an imperative
loop, which mirrors how the physical controller jumps between
states. Notice how we use a temporary variable ~T~ to avoid corrupting
data during the swap, exactly like the physical registers do.

#+BEGIN_SRC elisp
  (defun simulate-gcd-machine (a-init b-init)
    "Simulates the hardware state machine for GCD."
    (let ((reg-A a-init)
          (reg-B b-init)
          (reg-T 0))

      ;; The Controller (Simulated via a while loop)
      (while (not (= reg-B 0))
        ;; Step 1: Compute remainder and store in T
        (setq reg-T (% reg-A reg-B))

        ;; Step 2: Move B to A
        (setq reg-A reg-B)

        ;; Step 3: Move T to B
        (setq reg-B reg-T))

      ;; Machine halts. Result is in A.
      (princ (format "GCD Machine halted. Result in Register A: %s\n" reg-A))))

  ;; Test the machine
  (simulate-gcd-machine 206 40)
#+END_SRC

#+RESULTS:
: GCD Machine halted. Result in Register A: 2

